// Задані дійсні числа x, y.Визначити, чи належить точка з координатами(x, y) заштрихованій частині площини.
#include <iostream>

using namespace std;


int main()
{
    setlocale(LC_ALL, "Rus");
    float x; // Координата х
    float y; // Координата у
    int r = 3; // Радіус кола
    cout << "Введiть координату х";
    cin >> x;
    cout << "Введiть координату y";
    cin >> y;

    if (x * x + y * y > r * r)  // Ознака неналежності колу
        if (x > 0 || y < 0)  // Ознака неналежності другій чверті
            if (x < r && x > -r && y < r && y > -r) // Ознака належності квадрату

                cout << "Точка належить заштрихованiй частинi";

            else {
                cout << ("Точка не належить заштрихованiй частинi");
            }

        else {
            cout << ("Точка не належить заштрихованiй частинi");
        }

    else {
        cout << ("Точка не належить заштрихованiй частинi");
    }
    return 0;
   
}


/*
Приклади контрольних точок:
(1;1) - точка лежить в межах кола => Не належить заштрихованій частині
(4;-2) - точка лежить за межами квадрату => Не належить заштрихованій частині
(-3;3) - точка лежить у другій чверті => Не належить заштрихованій частині
(2,8;2,8) - точка не лежить в колі, не лежить у другій чверті, лежить в межах квадрата => Належить заштрихованій частині
*/
        



	
   



